In [1]:
import pandas as pd

In [2]:
file_path = './data/exam_sample.csv'
df = pd.read_csv(file_path)
df

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

In [12]:
# cut(): 특정 데이터를 동일한 간격으로 구분할때 사용...
# pd.cut(df['math'], 3)
df1 = pd.cut(df['math'], 3, labels=False)
df1

0    1
1    1
2    1
3    0
4    2
5    1
6    2
7    2
8    0
9    1
Name: math, dtype: int64

In [16]:
df['math'].groupby(df1).head(2)

0    50
1    60
3    30
4    90
6    80
8    20
Name: math, dtype: int64

In [17]:
df2 = df['math'].groupby(df1)
df2.head()

0    50
1    60
2    45
3    30
4    90
5    50
6    80
7    90
8    20
9    50
Name: math, dtype: int64

In [18]:
df2.agg(['count','mean','std','min','max'])

      count       mean       std  min  max
math
0         2  25.000000  7.071068   20   30
1         5  51.000000  5.477226   45   60
2         3  86.666667  5.773503   80   90

In [21]:
pd.qcut(df['math'] , 5, labels=False)

0    1
1    3
2    1
3    0
4    4
5    1
6    3
7    4
8    0
9    1
Name: math, dtype: int64